<div class=one>

Name: Fatima Momin  <br>
Email: fatimamomina423@gmail.com  <br>
GitHub: https://github.com/dashboard  <br>
Title:  Data Analysis and Data Cleaning <br>

</div>

<style>
.one {
    color: red;
    text-align:center;
}
</style>

**Step 1: Install Libraries**

**Install Pandas**

In [5]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\administrator\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\administrator\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\administrator\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\administrator\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\administrator\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\administrator\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

**Install Numpy**

In [6]:
%pip install numpy

Requirement already satisfied: numpy in c:\users\administrator\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

**Step 2: Import Necessary Libraries**

In [7]:
import pandas as pd

In [8]:
import numpy as np

**Step 3: Load the CSV data into DataFrame**

In [9]:
df=pd.read_csv('data.csv')

**Step 4: Display first 5 top rows**

In [10]:
print(df.head())
#df.head()     another method
# df=pd.read_csv('data.csv').head()     third method
# df

            Name Designation Gender   Age     Salary
0        Mukhtar   Professor      M  37.0   115000.0
1          Azziz     Teacher      M  30.0    35000.0
2         Mohsin    Engineer      M  29.0    50000.0
3  Naveed Fatima     Analyst      F  30.0    70000.0
4          Babar    Engineer      F  25.0  1500000.0

**Step 5: Check missing values**

In [11]:
print(df.isnull().sum())

Name           0
Designation    0
Gender         0
Age            1
Salary         2
dtype: int64

**Step 6: Remove Null Values**

In [12]:
SalaryMean=df['Salary'].mean()
df['Salary'].fillna(SalaryMean, inplace=True) #Another method of fillna
df['Salary'].isnull().sum()

C:\Users\Administrator\AppData\Local\Temp\ipykernel_13996\612746721.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(SalaryMean, inplace=True) #Another method of fillna

np.int64(0)

In [13]:
print(df['Age'].isnull().sum())

1

In [14]:
# AgeMedian=df['Age'].fillna(df['Age'].median())
# AgeMedian.isnull().sum()
AgeMedian=df['Age'].median()
df['Age'].fillna(AgeMedian, inplace=True) #Another method of fillna
df['Age'].isnull().sum()

C:\Users\Administrator\AppData\Local\Temp\ipykernel_13996\849061498.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(AgeMedian, inplace=True) #Another method of fillna

np.int64(0)

**Step 7: Correct any obvious data entry errors in "Age" Column**

In [15]:
df['Age']=df['Age'].apply(lambda x: x if x < 120 else AgeMedian)
#use loop of lambda check one by one no age will above more than 120

In [16]:
df

             Name Designation Gender   Age        Salary
0         Mukhtar   Professor      M  37.0  1.150000e+05
1           Azziz     Teacher      M  30.0  3.500000e+04
2          Mohsin    Engineer      M  29.0  5.000000e+04
3   Naveed Fatima     Analyst      F  30.0  7.000000e+04
4           Babar    Engineer      F  25.0  1.500000e+06
5            Aqsa   Scientist      F  22.0  1.725333e+05
6           Rafia     Analyst      F  29.0  2.000000e+04
7           Samra   Scientist      F  26.0  1.150000e+05
8            Eman    Engineer      F  28.0  3.500000e+04
9        Abdullah     Teacher      M  55.0  1.725333e+05
10          Mosib   professor      M  60.0  7.000000e+04
11          Ahmed    engineer      M  30.0  9.000000e+04
12          Ahsan     trainer      M  30.0  1.100000e+05
13          Wajid     teacher      M  67.0  2.000000e+03
14          Naeem     trainer      M  80.0  1.600000e+04
15         Qaisar   professor      M  20.0  1.700000e+05
16          Wajid    Engineer      M  85.0  1.900000e+05

In [17]:
#Check Outlaiyer
df['Salary'].apply(lambda x: x if x < 9.000000e+04 else SalaryMean)

0     172533.333333
1      35000.000000
2      50000.000000
3      70000.000000
4     172533.333333
5     172533.333333
6      20000.000000
7     172533.333333
8      35000.000000
9     172533.333333
10     70000.000000
11    172533.333333
12    172533.333333
13      2000.000000
14     16000.000000
15    172533.333333
16    172533.333333
Name: Salary, dtype: float64

**Step 8: Standardize the 'Designation' column to have consistent capitalization**

In [18]:
df['Designation']=df['Designation'].str.title()#correct words representation
df['Designation']

0     Professor
1       Teacher
2      Engineer
3       Analyst
4      Engineer
5     Scientist
6       Analyst
7     Scientist
8      Engineer
9       Teacher
10    Professor
11     Engineer
12      Trainer
13      Teacher
14      Trainer
15    Professor
16     Engineer
Name: Designation, dtype: object

**Step 9: Calculate the average salary by gender**

In [19]:
SalaryGender=df.groupby('Gender')['Salary'].mean()
SalaryGender #print avg salary by gender

Gender
F    318755.555556
M     92775.757576
Name: Salary, dtype: float64

In [20]:
GenDes=df.groupby('Designation')['Salary'].mean()
GenDes

Designation
Analyst       45000.000000
Engineer     373000.000000
Professor    118333.333333
Scientist    143766.666667
Teacher       69844.444444
Trainer       63000.000000
Name: Salary, dtype: float64

In [21]:
AgeDes=df.groupby('Designation')['Age'].mean()
AgeDes #Designation of age

Designation
Analyst      29.500000
Engineer     39.400000
Professor    39.000000
Scientist    24.000000
Teacher      50.666667
Trainer      55.000000
Name: Age, dtype: float64

**Step 10: Display high salary**

In [22]:
HighSalary=df[df['Salary']> 100000]
HighSalary #print up to 100000

        Name Designation Gender   Age        Salary
0    Mukhtar   Professor      M  37.0  1.150000e+05
4      Babar    Engineer      F  25.0  1.500000e+06
5       Aqsa   Scientist      F  22.0  1.725333e+05
7      Samra   Scientist      F  26.0  1.150000e+05
9   Abdullah     Teacher      M  55.0  1.725333e+05
12     Ahsan     Trainer      M  30.0  1.100000e+05
15    Qaisar   Professor      M  20.0  1.700000e+05
16     Wajid    Engineer      M  85.0  1.900000e+05

In [23]:
SortAge=df.sort_values(by='Age',ascending=True)
SortAge #Print Smaller to Greater

             Name Designation Gender   Age        Salary
15         Qaisar   Professor      M  20.0  1.700000e+05
5            Aqsa   Scientist      F  22.0  1.725333e+05
4           Babar    Engineer      F  25.0  1.500000e+06
7           Samra   Scientist      F  26.0  1.150000e+05
8            Eman    Engineer      F  28.0  3.500000e+04
2          Mohsin    Engineer      M  29.0  5.000000e+04
6           Rafia     Analyst      F  29.0  2.000000e+04
1           Azziz     Teacher      M  30.0  3.500000e+04
12          Ahsan     Trainer      M  30.0  1.100000e+05
3   Naveed Fatima     Analyst      F  30.0  7.000000e+04
11          Ahmed    Engineer      M  30.0  9.000000e+04
0         Mukhtar   Professor      M  37.0  1.150000e+05
9        Abdullah     Teacher      M  55.0  1.725333e+05
10          Mosib   Professor      M  60.0  7.000000e+04
13          Wajid     Teacher      M  67.0  2.000000e+03
14          Naeem     Trainer      M  80.0  1.600000e+04
16          Wajid    Engineer      M  85.0  1.900000e+05

In [24]:
SortAge=df.sort_values(by='Age',ascending=False)
SortAge #Print Greater to Smaller

             Name Designation Gender   Age        Salary
16          Wajid    Engineer      M  85.0  1.900000e+05
14          Naeem     Trainer      M  80.0  1.600000e+04
13          Wajid     Teacher      M  67.0  2.000000e+03
10          Mosib   Professor      M  60.0  7.000000e+04
9        Abdullah     Teacher      M  55.0  1.725333e+05
0         Mukhtar   Professor      M  37.0  1.150000e+05
1           Azziz     Teacher      M  30.0  3.500000e+04
11          Ahmed    Engineer      M  30.0  9.000000e+04
3   Naveed Fatima     Analyst      F  30.0  7.000000e+04
12          Ahsan     Trainer      M  30.0  1.100000e+05
2          Mohsin    Engineer      M  29.0  5.000000e+04
6           Rafia     Analyst      F  29.0  2.000000e+04
8            Eman    Engineer      F  28.0  3.500000e+04
7           Samra   Scientist      F  26.0  1.150000e+05
4           Babar    Engineer      F  25.0  1.500000e+06
5            Aqsa   Scientist      F  22.0  1.725333e+05
15         Qaisar   Professor      M  20.0  1.700000e+05

**Step 11: Save the cleaned DataFrame to a new CSV File**

In [28]:
df.to_csv('CleanData.csv',index=False)
# There's no need of indexes in dataset thats why index false

**Step 12: Display basic statistics of the DataFrame**

In [30]:
df.describe()#A lot of Difference b/w before df and now
#no any outlaiyer no any null values cleaned data

             Age        Salary
count  17.000000  1.700000e+01
mean   40.176471  1.725333e+05
std    20.794336  3.473600e+05
min    20.000000  2.000000e+03
25%    28.000000  3.500000e+04
50%    30.000000  9.000000e+04
75%    55.000000  1.700000e+05
max    85.000000  1.500000e+06